from colorama import init, Fore, Style

init()

# Памятка по заполнению:

# 1. Массив - это...
# 1. Синтаксис: пример синтаксиса.
# 2. Зачем? Ничего просто так не происходит.
# 2. Тезисно, своими словами, зачем нужен.
# 3. Конкретизация.
# 3. Напиши примеры использования. Буквально, примеры использования.
# 4. Структуризация.
# 4. Напиши теги, что бы позже объединить их поиском, ведь если на вопрос зачем ответ похож, то они рядом.
# 5. Иерархии, выстраивание связей, что к чему идёт.
# 6. Не упарывайся, не копай глубже чем нужно.

print(Fore.LIGHTYELLOW_EX + 'Циклы' + Style.RESET_ALL)

print(Fore.GREEN + '1. Циклы, это многократный повтор блоков кода при определённых условиях.' + Style.RESET_ALL)
print(Fore.GREEN + '' + Style.RESET_ALL)
