"""
Набор Текста.
"""

MAIN_MENU = ('\nКонвертер погоды v1.1\n'
             '\n--Основное меню--\n'
             '1. Информация.\n'
             '2. Конвертер.\n'
             '3. Выход.')

INFORMATION_MENU = ('\n--Меню информации--\n\n'
                    '1. Как этим пользоваться.\n'
                    '2. Кто тебя создал?\n'
                    '3. Выход.')

CONVERTER_MENU = ('\n--Меню конвертера--\n\n'
                  '1. Цельсии.\n'
                  '2. Кельвины.\n'
                  '3. Фаренгейты.\n'
                  '4. Выход.')

INFO_01 = '\nДля перемещения по программе используй цифры.\n' \
          'Целые цифры, не дробные, не выраженные словами.\n' \
          'Только цифры на клавиатуре.\n'

INFO_02 = 'Некая группа лис.\nОни прячутся в лесу, не отличаются ' \
          'сообразительностью...\nНо иногда у них что-то получается.'

INFO_03 = ('\n--Примечание--\n\n'
           'Существует абсолютный ноль.\nМинимальная возможная температура'
           ' = 0K (-459.67°F, -273.15°C).\nНиже этого значения температуры'
           ' не существует.\nПо крайней мере, в нашей Вселенной.\n'
           '\nСколько градусов?\n')

RND_TEXT = ('Так, давай по новой...', 'Ну и что ты мне сделаешь?',
            'Инициализация...', 'Системная ошибка... Перезагружаюсь.',
            'Вы все, умрёте.')

WRONG_ANSWER = ('Нет нет нет... Я тебя не понимаю.')
